[{"title":"产品管理中的对内沟通","date":"2017-03-06T20:41:00.000Z","path":"2017/03/06/product-management-communication/","text":"产品经理的一个重要职责就是通过沟通来组织和带领团队共同实现企业目标。这里主要分享的是在企业内部沟通的一些最佳实践。分别从愿景，用户，和项目管理的角度展开。 愿景愿景是为什么做一个产品的核心原因，是团队往一个统一方向前进的核心驱动力。愿景的沟通是否做好，可以用这个简单方法来测试：开会时随机问下公司的愿景是什么，看大家是能不假思索地写出完全一致的愿景，还是要想一想然后描述出几个好像类似，但其实各不相同的版本？如果是后者，那产品经理在沟通上就需要尽快改进了。 首先如果愿景还没有完全确定（比如初创企业，大型企业的新业务线），只是大致讨论过，或者过于冗长，那么需要先制定一个明确的，简要的愿景描述。几句话，最好是一句话，概括出目标用户，能提供的价值，和今后想达到的状态。愿景是共同协作的基石，宏观战略上可以有不同的看法，具体产品特性也可以各抒己见。但如果愿景不一样，那就是无本之木，没必要一起工作了。所以，先达成明确确定的愿景描述。 有了愿景还远远不够。要真正发挥作用，还有件重要的事要做，叫：重复，重复，再重复。各种场合，各种时机：把愿景贴到墙上去，让人一进门就看见；写到文档中去，第一行就看见；挂到会议室白板上，一开会就看见。人是健忘的动物，特别是快节奏高压力下，经常被每天的工作内容消耗掉了大部分精力，在取舍各种细节时更多考虑的是眼前要完成的任务，而不是长远为之奋斗的目标。这就需要产品经理能够在一对一交流，群体会议，电子邮件中，不停提醒团队共同的使命是什么。特别是意见不一致的时候，特别是被短期 KPI 增长诱惑的时候。这种重复要做到什么程度呢？夸张点（其实也不夸张），最好是团队每天晚上做梦都在想，自己正在做的东西怎么能更好地帮助实现愿景。 用户产品是否能带来价值，用户都会用脚投票。产品经理除了要能有强大的同理心，理解用户的需求外。还需要把这种需求用合适的方法，向企业内部沟通。通常说产品是衔接业务和技术的桥梁，在业务面前代表技术，在技术面前代表业务。但更重要的是，在所有部门面前，产品都要能很好的代表用户，说出用户想表达却表达不出来的东西。 一般这种沟通，逻辑推理、统计数据、具体实例组合在一起使用效果比较好。不过如果时间有限，不能面面俱到，具体例子的说服力在实践中会更强些。一是具体例子通常包含上下文情景，更加“看得到，摸得着”，相比抽象的逻辑推导，更容易让对方产生感性认知，体会到用户的感受，如果产品经理在沟通中时不时被要求“说人话”，可尝试多用具体例子来阐述观点和需求。二是实例相对来说，也比较好获取，每个样本都是一个例子。虽然个案究竟有多少代表性是个疑问，但如果能连续抛出三个具体例子反映一致痛点，获得支持的概率就比较大。市场的快速变化决定了产品没有足够资源和时间来做全面分析后才开始行动，这也是为什么快速试错会成为主流。即使是盲人摸象，只要摸的够快，足够灵活，最后生存和成长的机会在现今的时代会更好些。 将用户的需求和痛点向内沟通时，预期的设置非常重要，特别是负面影响的预期。高速迭代时，大家的注意力都在做了什么，可以解决什么问题，却忽略了随之而来的代价。比如产品界面提供傻瓜式的操作方便了入门用户，却不能满足高级用户；如改成自定义提供自由度，入门用户又会望而却步；若两种都支持，则必然增加界面复杂度和转换逻辑。每个改变都有其优势和代价，特别是对现有产品或特性的迭代，很可能带来一部分当前用户的抱怨。合理的设置预期，说明我们会解决什么，不解决什么，会产生什么新问题，不但能让团队理解这是一个清晰的权衡抉择，而非考虑不周，也能让团队提前做好心理准备和应对措施。 项目管理取决于公司的规模，大公司有时会让专人来负责项目管理。但即便如此，产品经理作为产品成功或失败的最终负责人，仍必须在项目管理上投入不少精力。而没有专属的项目经理时，产品经理主要的时间都会投入在这，覆盖整个开发，推广，和迭代过程。 项目管理中的沟通更接近运营层面，所以也比较容易标准化，适合采用一定流程，比如典型的敏捷开发。过程中各种会议不可避免，这里强烈推荐无论什么会，在开始前先把这次会议的目标，需要的时间和预期明确陈述一遍，哪怕之前的邮件中已经写过。这样做能帮助参会人员从会前别的工作中脱离出来，把精神集中在当前议题，让每个人清晰有意识地决定要么作出有意义的贡献和思考，要么离开会议室，把时间投入到回报更高的地方去。而会议结束前，建议产品经理把达成的关键点向大家快速总结一遍：谁，做什么，预估几月几号能出结果。一来确认是否有异议，二来清晰化每个人要采取的行动。会议结束后把结论发邮件作备份。 除了流程外，项目管理中细节众多，可以采用工具促进沟通。比如 phabricator，jira，teambition，trello 等等都不错。只要能让团队成员方便地看到进度，反馈问题，更新状态就可以。另外，定期的总结邮件能帮助大家认识到现状离预期还有多少距离，以及下一步的方向和行动，思考手上工作和公司战略的联系。 每个产品经理都可以也必须不断提高自己的沟通能力，针对不同的人、不同背景、不同场合，定制化说什么、怎么说，从而有效带领团队往共同的目标前进。希望这些最佳实践能对大家有所帮助，也欢迎交流不同想法。","tags":[{"name":"product","slug":"product","permalink":"http://www.shanyuanming.com/tags/product/"}]},{"title":"产品决策：数据驱动 VS 数据知情","date":"2017-02-21T05:46:00.000Z","path":"2017/02/20/product-decision-data-driven-data-informed/","text":"很多企业都在了解如何更好在产品决策中运用数据，来进一步促进业务增长。产品决策中的数据，主要指各种数字化的信息，比如交易数据，用户在web／app上的行为数据，GPS位置数据，服务器日志数据等等，是真实世界所有信息的一个子集。产品经理对数据的合理运用，往往决定了决策的质量。这里介绍产品决策中，两种主要的数据运用方法：数据驱动（data driven）和数据知情（data informed），以及他们各自的适用范围. 数据驱动数据驱动的意思是在决策中，数据起主导地位，也就是说，一旦取得了相关的量化数据，下一步怎么做也就基本由这些数据结果确定了。不少硅谷企业并不倡导这种方式，典型的比如facebook，airbnb，atlassian等等。他们的观点总体上并没错（在下面“数据知情”部分中会简要描述），但数据驱动其实仍有其适用范围，这个范围主要有以下特征： 决策所需要的关键因素容易量化 已经存在几个备选方案，决策工作是从其中选择一个或者决定优先顺序 涉及战术层面，相对短期局部，主要看重细节。 这里举两个符合这些特征的职能： 产品运营：产品运营主要处理相当多的日常活动，重复度高，KPI较具体，数据采集比较容易和高频，相对来说就比较容易用数据驱动的方法来确定决策。比如对于SaaS产品，客户的产品使用度很大程度上能预测客户的流失概率，以此为基础建模预测客户的健康状康，就能较好地决定客户成功团队进行主动干预的优先级。又比如产品性能管理（APM），根据app性能的各项指标，比如延迟数据，负载情况，异常统计等等，基本就能决定下一步是要增加更多服务器资源，还是进行故障转移（failover）或者采取其他行动，当中不仅可以数据驱动决策，甚至可以让电脑根据数据直接完成决策，并采取相应行动，完全自动化闭环而不用人工干预。 产品局部优化：典型的比如优化产品的某些细节体验，进行不同版本的AB测试（但不是那种战略性，创新性，颠覆性的测试）。 在这种情境下，设立一个核心的成功指标，以及相应的第二类监测指标，如果改版方案在核心指标上有明显优势，而且他监测指标并无明显受损，那么就基本上可以决定让改版方案上线（或者扩大测试用户比例继续衡量，如果用户数很大的话）。又比如，上线全新的社交登录，却发觉部署后登陆人数立即开始直线下滑，这时候的决策是什么？很简单，回滚。然后再从各方面开始排查原因并修复问题。 数据知情与数据驱动不同，数据知情指在决策中，数据起辅助地位，取得数据后（定量或者定性的），不同的人可能有不同的解读，考虑不同的其他因素，作出不同的决策。这是很多诸如FB等企业推荐的数据使用方式，往往会强调除了数据外，还需要同理心，商业直觉，愿景等等，才能做出合适的产品决策。这些说的都挺不错的，就是稍微“艺术”了些，下面我说下客观原因，为什么数据知情很多情况下比数据驱动更合适些 能收集的数据还是太少可能很多人看到这里会问，不都是大数据时代了么，每个用户细节行为都跟踪了，还少？确实，现在的数据量都要用zettabytes来做单位了，相比十年前多了好几个数量级，可谓“大数据”。但这些数据基本上都是线上的web／app数据，就算加上GPS，二维码，智能硬件等线下的部分，相比们真实的世界的所有信息，也还只是“小数据”。比如平时和人对话交谈，和谁交谈的，什么时候谈的，谈了些什么，谈的时候语气如何，环境如何，谈话的人情绪如何，表情身体语言如何变化等等，这些信息并没有被数字化的追踪成为数据。再比如看书（即使是用kindle看的），哪些章节重点看了，哪些页面反复看了，是前一段还是后一段眼球关注的时间更多，思考的更多，对大脑影响的更多，这些信息，也没有被记录。这里有现阶段产品实现的挑战，比如还没有出现像科幻电影里，每天通过人体的体液，就能自动判断人的健康状况并提示相应改善方法。也有隐私法规的挑战，假设有一天，有一款产品真能追踪记录人的所有行为（可不是什么web／app中的行为这么小一块，而是生活中的所有行为），有多少用户愿意被这样记录呢？有多少人会愿意自己和人说的每句话，听到的每句话都被记录在案？又有多少人会愿意被记录卫生间里具体每个动作是什么，释放物什么情况。 和一个业界资深人士交谈1小时得到的信息可能如醍醐灌顶，彻底改变之前的决策，而诸如此类的核心信息根本没有成为数据，换句话说产品中存在的数据只代表了真实世界非常小的一部分信息，只反映了一个非常有限的情况，那自然无法靠数据去驱动（有限情况之外的）决策，而只能作为信息源之一，辅助支持决策了。 电脑的计算能力还是太弱或许很多人认为，电脑的计算能力已经非常强大，国际象棋和围棋中，计算机都已击败人类，德州扑克也快要被攻克。当然了，现在的计算力比起以前是增强不少，可如果以数据驱动为要求来看，那计算能力就还是太不够了。首先，很多决策并非AB测试那样，非A即B，选一个就行。更多的决策是开放问题，完全没有固定选项，需要从无到有去构建出潜在的备选方案。如果电脑无法通过计算数据，生成方案，那自然也无法驱动决策，只能是提供信息，辅助人来决策。第二，即使有的决策是在几个方案中选择一个，但如果输入信息难以量化，还是不行。比如网约车新规定出台，怎么解读？对滴滴什么影响？电脑没法解读，没法计算出量化的影响，那就算有候选方案，也无法决策选择哪一个。 所以产品战略问题，开放问题，各种宏观的目标和方向性问题，数据知情的方式还是比数据驱动合理多了。公司刚成立时，用户数量有限，数据较少。这时数据知情的方式更适合决策。当公司变成了中大型公司，积累了较多数据，数据驱动的方式就会越来越重要，但适用范围主要是运营和战术层面，而在产品战略层面，数据知情仍是更好的方式。 将来的趋势当然我相信，将来会有更多的信息被高效地转化成数据，就像现在记录用户在web／app中的行为和交易一样。而电脑的计算力也会继续加强，产品决策中数据驱动的适用范围会不断扩大。但在宏观战略决策上，要真正实现数据驱动，需要真实世界信息能大部分转化成数据，并且电脑计算力大幅提升（比如真正实现量子计算，涉及到AI多大程度上能取代人脑的问题），在可预见的将来，数据知情仍然会是主流。 PS1: 欢迎来信探讨各种不同观点和最佳实践 PS2: 此链接是FB产品设计VP Julie Zhuo关于运用数据的一些观点","tags":[{"name":"product","slug":"product","permalink":"http://www.shanyuanming.com/tags/product/"},{"name":"data","slug":"data","permalink":"http://www.shanyuanming.com/tags/data/"}]}]